In [1]:
import pandas as pd
x = pd.Series(['hi', 'hello', 'hey'])
print(x)

0       hi
1    hello
2      hey
dtype: object

In [2]:
date_series = pd.date_range(start = '05-01-2021', end = '05-12-2021')
print(date_series)

DatetimeIndex(['2021-05-01', '2021-05-02', '2021-05-03', '2021-05-04',
               '2021-05-05', '2021-05-06', '2021-05-07', '2021-05-08',
               '2021-05-09', '2021-05-10', '2021-05-11', '2021-05-12'],
              dtype='datetime64[ns]', freq='D')

In [6]:
import pandas as pd
  
# dictionary with list object in values
details = {
              'Name' : ['Megha', 'Sundu', 'Ali', 'KK','Anusha'],
              'Age' : [21, 22, 22, 22,22],
              'University' : ['KTU', 'JNU', 'DU', 'BHU','CU'],
          }
# creating a Dataframe object 
df = pd.DataFrame(details)
df

     Name  Age University
0   Megha   21        KTU
1   Sundu   22        JNU
2     Ali   22         DU
3      KK   22        BHU
4  Anusha   22         CU

In [19]:
lists = [[1, 'Megha', 21],
         [2, 'Ali', 22],
         [3, 'KK', 22]]

dataframe = pd.DataFrame(lists, columns = ['id', 'name', 'age'])

print(dataframe)

   id   name  age
0   1  Megha   21
1   2    Ali   22
2   3     KK   22

In [22]:
# Import pandas
import pandas as pd
# reading csv file
pd.read_csv("exe4_5.csv")

    ID         Name
0  101        Megha
1  102        Remya
2  103  Sreelakshmi
3  104         Hari

In [26]:
import numpy as np
import pandas as pd
df = pd.DataFrame({'Name': ['Raj', 'Akhil', 'Sonum', 'Tilak', 'Divya', 'Megha'],
                   'Age': [20, 22, 21, 19, 17, 23],
                   'Rank': [1, np.nan, 8, 9, 4, np.nan]})
print('DATAFRAME')
df

DATAFRAME

    Name  Age  Rank
0    Raj   20   1.0
1  Akhil   22   NaN
2  Sonum   21   8.0
3  Tilak   19   9.0
4  Divya   17   4.0
5  Megha   23   NaN

In [29]:
import pandas as pd
data = {'Name':['Megha', 'Sundu', 'Anusha', 'KK', 'Ali'],
        'Age':[21, 24, 22, 32, 35],
        'Address':['Kozhikode', 'Alappuzha', 'Kozhikode', 'Kannur', 'kollam'],
        'Qualification':['MCA', 'Msc', 'MCA', 'Phd', '10th'] }
index = {'a', 'b', 'c', 'd', 'e'}
df = pd.DataFrame(data, index)
df.reset_index(inplace = True, drop = True)
  
df

     Name  Age    Address Qualification
0   Megha   21  Kozhikode           MCA
1   Sundu   24  Alappuzha           Msc
2  Anusha   22  Kozhikode           MCA
3      KK   32     Kannur           Phd
4     Ali   35     kollam          10th